
module(...,package.seeall)

--[[
函数名：init
功能  ：初始化LCD参数
参数  ：无
返回值：无
]]
function init()
    local para =
    {
        width = 240, --分辨率宽度，128像素；用户根据屏的参数自行修改
        height = 240, --分辨率高度，160像素；用户根据屏的参数自行修改
        bpp = 16, --位深度，彩屏仅支持16位
        bus = disp.BUS_SPI4LINE, --LCD专用SPI引脚接口，不可修改
        xoffset = 0, --X轴偏移
        yoffset = 0, --Y轴偏移
        freq = 50000000, --spi时钟频率，支持110K到13M（即110000到13000000）之间的整数（包含110000和13000000）
        pinrst = pio.P0_6, --reset，复位引脚
        pinrs = pio.P0_1, --rs，命令/数据选择引脚/268开发板为15
        --初始化命令
        --前两个字节表示类型：0001表示延时，0000或者0002表示命令，0003表示数据
        --延时类型：后两个字节表示延时时间（单位毫秒）
        --命令类型：后两个字节命令的值
        --数据类型：后两个字节数据的值
        initcmd =
        {
            0x00010000 + 60,
            0x00020011,
            0x00020036,
            0x00030000 + 0,--横屏控制 用盖板要用60 直接接屏用00
            0x0002003A,
            0x00030005,
            0x000200B2,
            0x0003000C,
            0x0003000C,
            0x00030000,
            0x00030033,
            0x00030033,
            0x000200B7,
            0x00030035,
            0x000200BB,
            0x00030032,
            0x000200C2,
            0x00030001,
            0x000200C3,
            0x00030015,
            0x000200C4,
            0x00030020,
            0x000200C6,
            0x0003000F,
            0x000200D0,
            0x000300A4,
            0x000300A1,
            0x000200E0,
            0x000300D0,
            0x00030008,
            0x0003000E,
            0x00030009,
            0x00030009,
            0x00030005,
            0x00030031,
            0x00030033,
            0x00030048,
            0x00030017,
            0x00030014,
            0x00030015,
            0x00030031,
            0x00030034,
            0x000200E1,
            0x000300D0,
            0x00030008,
            0x0003000E,
            0x00030009,
            0x00030009,
            0x00030015,
            0x00030031,
            0x00030033,
            0x00030048,
            0x00030017,
            0x00030014,
            0x00030015,
            0x00030031,
            0x00030034,
            0x00020021,
            0x00020029,
        },
        --休眠命令
        sleepcmd = {
            0x00020010,
        },
        --唤醒命令
        wakecmd = {
            0x00020011,
        }
    }
    disp.init(para)
    disp.setbkcolor(0)
    disp.clear()
    disp.update()
end

--控制SPI引脚的电压域
pmd.ldoset(15,pmd.LDO_VLCD)--2g为7
pm.wake("lcd_init")
init()
pm.sleep("lcd_init")
sys.publish("LCD_INIT")
--打开背光
--实际使用时，用户根据自己的lcd背光控制方式，添加背光控制代码

